Былков_ДА_70180166/src/Documents/ИдентификацияАкадемическихЗадолженностей/ИдентификацияАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИдентификацияАкадемическихЗадолженностей</name>
  <basedOn>Document.АкадемическаяНеуспеваемость</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильСтудента</name>
    <type>
      <types>CatalogRef.ПрофилиПодготовкиСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.АкадемическаяНеуспеваемость</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристика</name>
    <attributes>
      <name>Дисциплины</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.ФормаКонтроля</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Былков_ДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильСтудента</name>
    <type>
      <types>CatalogRef.ПрофилиПодготовкиСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Былков_ДА_70180166/src/Documents/ИдентификацияАкадемическихЗадолженностей/ObjectModule.bsl
&НаСервере
// Основная процедура заполнения документа на основании
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АкадемическаяНеуспеваемость") Тогда
        // Заполнение шапки
        ЛичныйИндекс = ДанныеЗаполнения.ИндексСтудента;
        Основание = ДанныеЗаполнения.Ссылка; 
        
        // Проверяем наличие записей в табличной части
        Если ДанныеЗаполнения.ХарактеристикаСтудента.Количество() = 0 Тогда
            ВызватьИсключение ("У студента отсутствуют академические задолженности!");
        КонецЕсли;
        
        // Проверяем наличие ИндексСтудента
        Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ИндексСтудента) Тогда
            ВызватьИсключение ("В документе-основании не указан ИндексСтудента!");
        КонецЕсли;
        
        // Проверяем, нет ли уже документа для текущего студента
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    ИдентификацияАкадемическихЗадолженностей.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.ИдентификацияАкадемическихЗадолженностей КАК ИдентификацияАкадемическихЗадолженностей
        |ГДЕ
        |    ИдентификацияАкадемическихЗадолженностей.ЛичныйИндекс = &ЛичныйИндекс";
        
        Запрос.УстановитьПараметр("ЛичныйИндекс", ДанныеЗаполнения.ИндексСтудента);
        Результат = Запрос.Выполнить();
      	Выборка = Результат.Выбрать();

    	Если Выборка.Количество() > 0 Тогда
            ВызватьИсключение ("Для студента с индексом «" + ДанныеЗаполнения.ИндексСтудента + 
                             "» уже существует документ «Идентификации академических задолженностей»!");
        КонецЕсли;
        
        // Получаем и проверяем данные студента по индексу
        ДанныеСтудента = ПолучитьДанныеСтудентаПоИндексу(ДанныеЗаполнения.ИндексСтудента);
        
        Если ДанныеСтудента = Неопределено Тогда
            ВызватьИсключение ("Не удалось найти студента с индексом: " + ДанныеЗаполнения.ИндексСтудента);
        КонецЕсли;
               
        // Заполняем реквизиты документа
        ЭтотОбъект.Студент = ДанныеСтудента.СсылкаСтудента; // Используем ссылку на студента
        ЭтотОбъект.Группа = ДанныеСтудента.ГруппаСсылка;
        ЭтотОбъект.НаправлениеПодготовки = ДанныеСтудента.НаправлениеПодготовки;
        ЭтотОбъект.Факультет = ДанныеСтудента.Факультет;
        ЭтотОбъект.Семестр = ДанныеСтудента.Семестр;
        ЭтотОбъект.ФормаОбучения = ДанныеСтудента.ФормаОбучения;
        ЭтотОбъект.ПрофильСтудента = ДанныеСтудента.ПрофильСтудента;
        ЭтотОбъект.ЛичныйИндекс = ДанныеЗаполнения.ИндексСтудента; // Сохраняем индекс из исходного документа

        // Копируем дисциплины из исходного документа
        ЗаполнитьТабличнуюЧастьИзОснования(ДанныеЗаполнения.ХарактеристикаСтудента);
        
    КонецЕсли;   
    
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтудентаПоИндексу(ИндексСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Студенты.ЛичныйИндекс КАК ЛичныйИндекс,
    |	Студенты.Группа КАК Группа,
    |	Студенты.НаправлениеПодготовки КАК НаправлениеПодготовки,
    |	Студенты.Факультет КАК Факультет,
    |	Студенты.Семестр КАК Семестр,
    |	Студенты.ФормаОбучения КАК ФормаОбучения,
    |	Студенты.Наименование КАК НаименованиеСтудента,
    |	Студенты.Ссылка КАК СсылкаСтудента,
    |	Студенты.ПрофильСтудента КАК ПрофильСтудента
    |ИЗ
    |	Справочник.Студенты КАК Студенты
    |ГДЕ
    |	Студенты.ЛичныйИндекс = &ИндексСтудента";
    
    Запрос.УстановитьПараметр("ИндексСтудента", ИндексСтудента);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Результат = Новый Структура;
        Результат.Вставить("ЛичныйИндекс", Выборка.ЛичныйИндекс);
        Результат.Вставить("НаименованиеСтудента", Выборка.НаименованиеСтудента);
        Результат.Вставить("СсылкаСтудента", Выборка.СсылкаСтудента);
        Результат.Вставить("ГруппаСсылка", Выборка.Группа);

        Результат.Вставить("НаправлениеПодготовки", Выборка.НаправлениеПодготовки);
		Результат.Вставить("ПрофильСтудента", Выборка.ПрофильСтудента);
        Результат.Вставить("Факультет", Выборка.Факультет);
        Результат.Вставить("Семестр", Выборка.Семестр);
        Результат.Вставить("ФормаОбучения", Выборка.ФормаОбучения);
        
        Возврат Результат;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

&НаСервере
// Заполнение табличной части из документа-основания
Процедура ЗаполнитьТабличнуюЧастьИзОснования(ТаблицаОснования)
    
    ЭтотОбъект.Характеристика.Очистить();
    
    Для Каждого СтрокаОснования Из ТаблицаОснования Цикл
        НоваяСтрока = ЭтотОбъект.Характеристика.Добавить();
        НоваяСтрока.Дисциплины = СтрокаОснования.Дисциплина; 
        НоваяСтрока.ФормаКонтроля = ПолучитьФормуКонтроляДисциплины(СтрокаОснования.Дисциплина);
		
	КонецЦикла;
    
    Если ЭтотОбъект.Характеристика.Количество() = 0 Тогда
        ВызватьИсключение "Не удалось заполнить табличную часть!";
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
// Получение формы контроля для дисциплины
Функция ПолучитьФормуКонтроляДисциплины(Дисциплина)
    
    Если Не ЗначениеЗаполнено(Дисциплина) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Дисциплины.ФормаКонтроля КАК ФормаКонтроля
    |ИЗ
    |    Справочник.Дисциплины КАК Дисциплины
    |ГДЕ
    |    Дисциплины.Ссылка = &Дисциплина";
    
    Запрос.УстановитьПараметр("Дисциплина", Дисциплина);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.ФормаКонтроля;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции
